In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
df=pd.read_csv('insurance.csv')

In [3]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [4]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [5]:
df.nunique()

age           47
sex            2
bmi          548
children       6
smoker         2
region         4
charges     1337
dtype: int64

In [6]:
df.shape

(1338, 7)

In [7]:
df2=df.copy()
df3=df.copy()
df4=df.copy()
df5=df.copy()
df6=df.copy()
df7=df.copy()
df8=df.copy()
df9=df.copy()
df10=df.copy()
df11=df.copy()
df12=df.copy()
df13=df.copy()
df14=df.copy()

# Label Encoding

In [8]:
from sklearn.preprocessing import LabelEncoder

In [9]:
le=LabelEncoder()

In [10]:
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [11]:
df.sex=le.fit_transform(df['sex'])

In [12]:
df.head()

   age  sex     bmi  children smoker     region      charges
0   19    0  27.900         0    yes  southwest  16884.92400
1   18    1  33.770         1     no  southeast   1725.55230
2   28    1  33.000         3     no  southeast   4449.46200
3   33    1  22.705         0     no  northwest  21984.47061
4   32    1  28.880         0     no  northwest   3866.85520

In [13]:
df2.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [14]:
from pandas.core.dtypes.common import is_numeric_dtype

In [15]:
for i in df2.columns:
    if is_numeric_dtype(df2[i]):
        continue
    df2[i]=le.fit_transform(df2[i])

In [16]:
df2.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# One hot Encoder

In [17]:
dummy=pd.get_dummies(df3['sex'])

In [18]:
dummy.head()

   female  male
0       1     0
1       0     1
2       0     1
3       0     1
4       0     1

In [19]:
dummy=dummy.drop('female', axis=1)

In [20]:
dummy.head()

   male
0     0
1     1
2     1
3     1
4     1

In [21]:
dummy2=pd.get_dummies(df3['smoker'])

In [22]:
dummy2=dummy2.drop('yes', axis=1)

In [23]:
dummy2.head()

   no
0   0
1   1
2   1
3   1
4   1

In [24]:
dummy3=pd.get_dummies(df3['region'])

In [25]:
dummy3=dummy3.drop('southwest', axis=1)

In [26]:
dummy3.head()

   northeast  northwest  southeast
0          0          0          0
1          0          0          1
2          0          0          1
3          0          1          0
4          0          1          0

In [27]:
df4.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [28]:
df4=df4.drop(["sex", "smoker", "region"], axis = 1)

In [29]:
df4.head()

   age     bmi  children      charges
0   19  27.900         0  16884.92400
1   18  33.770         1   1725.55230
2   28  33.000         3   4449.46200
3   33  22.705         0  21984.47061
4   32  28.880         0   3866.85520

In [30]:
NewDf=pd.concat([df4,dummy,dummy2,dummy3],axis=1)

In [31]:
NewDf.head()

,age,bmi,children,charges,male,no,northeast,northwest,southeast
0,19,27.900,0,16884.92400,0,0,0,0,0
1,18,33.770,1,1725.55230,1,1,0,0,1
2,28,33.000,3,4449.46200,1,1,0,0,1
3,33,22.705,0,21984.47061,1,1,0,1,0
4,32,28.880,0,3866.85520,1,1,0,1,0

In [32]:
df5.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [33]:
df5.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [34]:
for i in df5.columns:
    if is_numeric_dtype(df6[i]):
        continue
    one=pd.get_dummies(df5[i],drop_first=True)
    df5.drop(df5[[i]], axis = 1, inplace=True)
    df5=pd.concat([df5,one], axis=1)

In [35]:
df5.head()

,age,bmi,children,charges,male,yes,northwest,southeast,southwest
0,19,27.900,0,16884.92400,0,1,0,0,1
1,18,33.770,1,1725.55230,1,0,0,1,0
2,28,33.000,3,4449.46200,1,0,0,1,0
3,33,22.705,0,21984.47061,1,0,1,0,0
4,32,28.880,0,3866.85520,1,0,1,0,0

# Ordinal Encoder

In [36]:
df6.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [38]:
df6.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [40]:
from sklearn.preprocessing import OrdinalEncoder

In [41]:
side=['southwest', 'southeast', 'northwest', 'northeast']

In [44]:
ordinal=OrdinalEncoder(categories=[side])

In [46]:
encoded=ordinal.fit_transform(df6[['region']])

In [48]:
encoded

array([[0.],
       [1.],
       [1.],
       ...,
       [1.],
       [0.],
       [2.]])

In [50]:
New_region=pd.DataFrame(encoded, columns=['region'])

In [52]:
df6.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [54]:
New_region.head()

   region
0     0.0
1     1.0
2     1.0
3     2.0
4     2.0

In [56]:
df6.region=New_region

In [58]:
df6.head()

   age     sex     bmi  children smoker  region      charges
0   19  female  27.900         0    yes     0.0  16884.92400
1   18    male  33.770         1     no     1.0   1725.55230
2   28    male  33.000         3     no     1.0   4449.46200
3   33    male  22.705         0     no     2.0  21984.47061
4   32    male  28.880         0     no     2.0   3866.85520

In [61]:
for i in df7.columns:
    if is_numeric_dtype(df7[i]):
        continue
    unique = df7[i].unique()
    df7[i]=OrdinalEncoder(categories=[unique]).fit_transform(df7[[i]])

In [62]:
df7.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     0.0     0.0  16884.92400
1   18  1.0  33.770         1     1.0     1.0   1725.55230
2   28  1.0  33.000         3     1.0     1.0   4449.46200
3   33  1.0  22.705         0     1.0     2.0  21984.47061
4   32  1.0  28.880         0     1.0     2.0   3866.85520

# Value replace

In [64]:
df8.region.unique()

array(['southwest', 'southeast', 'northwest', 'northeast'], dtype=object)

In [65]:
df8.region=df9.region.replace(['southwest', 'southeast', 'northwest', 'northeast'],[0,1,2,3])

In [66]:
df8.head()

   age     sex     bmi  children smoker  region      charges
0   19  female  27.900         0    yes       0  16884.92400
1   18    male  33.770         1     no       1   1725.55230
2   28    male  33.000         3     no       1   4449.46200
3   33    male  22.705         0     no       2  21984.47061
4   32    male  28.880         0     no       2   3866.85520